app/services/enrollment_service.rb

INSERT INTO "enrollments" ("user_id", "school_id", "course_id", "academic_year", "status", "discarded_at", "created_at", "updated_at") VALUES (4, 1, 1, 2026, 0, NULL, '2026-04-17 14:28:49.895719', '2026-04-17 14:28:49.895719') RETURNING "id"
INSERT INTO "transcripts" ("enrollment_id", "academic_year", "locked", "created_at", "updated_at") VALUES (1, 2026, FALSE, '2026-04-17 14:28:49.927083', '2026-04-17 14:28:49.927083') RETURNING "id"
---
  def enroll_in_course(course)
    ActiveRecord::Base.transaction do
      enrollment = Enrollment.create!(
        user: user, school: school, course: course,
        academic_year: academic_year, status: :active
      )
      Transcript.create!(enrollment: enrollment, academic_year: academic_year)