app/controllers/admin/enrollments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
SELECT "courses".* FROM "courses" INNER JOIN "study_plans" ON "study_plans"."school_id" = 1 AND "study_plans"."id" = "courses"."study_plan_id" WHERE "study_plans"."school_id" = 1 ORDER BY "courses"."name" ASC
SELECT DISTINCT "enrollments"."academic_year" FROM "enrollments" WHERE "enrollments"."school_id" = 1 AND "enrollments"."school_id" = 1
---
  def index
    @enrollments = policy_scope(Enrollment)
                     .includes(:user, :course)
                     .order(:academic_year, "users.surname", "users.name")
    @enrollments = @enrollments.where(academic_year: params[:year]) if params[:year].present?
    @enrollments = @enrollments.where(course_id: params[:course_id]) if params[:course_id].present?
    @courses = Course.joins(:study_plan).where(study_plans: { school: current_school }).order(:name)
    @years = Enrollment.where(school: current_school).distinct.pluck(:academic_year).sort.reverse