app/controllers/admin/study_plans_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."study_plan_id" = 1 ORDER BY "courses"."academic_year" ASC, "courses"."year_in_plan" ASC, "courses"."name" ASC
SELECT "grading_instances".* FROM "grading_instances" WHERE "grading_instances"."study_plan_id" = 1 ORDER BY "grading_instances"."academic_year" ASC, "grading_instances"."position" ASC
---
  def show
    authorize @study_plan
    @subjects_by_year = @study_plan.study_plan_subjects
                                   .includes(:subject)
                                   .order(:year_in_plan, "subjects.name")
                                   .group_by(&:year_in_plan)
    @courses = @study_plan.courses.order(:academic_year, :year_in_plan, :name)
    @grading_instances = @study_plan.grading_instances.order(:academic_year, :position)