app/controllers/admin/users_controller.rb

SELECT "user_role_schools"."role" FROM "user_role_schools" WHERE "user_role_schools"."user_id" = 1 AND "user_role_schools"."school_id" = 1 AND (valid_from <= '2026-04-17' AND (valid_until IS NULL OR valid_until >= '2026-04-17'))
SELECT 1 AS one FROM "user_role_schools" WHERE "user_role_schools"."user_id" = 1 AND "user_role_schools"."school_id" = 1 AND (valid_from <= '2026-04-17' AND (valid_until IS NULL OR valid_until >= '2026-04-17')) AND "user_role_schools"."role" IN (0, 1) LIMIT 1
SELECT DISTINCT "users".* FROM "users" INNER JOIN "user_role_schools" ON "user_role_schools"."user_id" = "users"."id" WHERE "user_role_schools"."school_id" = 1 ORDER BY "users"."surname" ASC, "users"."name" ASC
---
  def index
    @users = policy_scope(User)
               .joins(:user_role_schools)
               .where(user_role_schools: { school: current_school })
               .distinct
               .order(:surname, :name)
    @users = @users.where("users.name ILIKE ? OR users.surname ILIKE ? OR users.email ILIKE ?",
                           "%#{params[:q]}%", "%#{params[:q]}%", "%#{params[:q]}%") if params[:q].present?