app/policies/application_policy.rb

  def roles
    @roles ||= UserRoleSchool.where(user: user, school: school).active_on.pluck(:role)
---
SELECT "user_role_schools"."role" FROM "user_role_schools" WHERE "user_role_schools"."user_id" = 1 AND "user_role_schools"."school_id" = 1 AND (valid_from <= '2026-04-17' AND (valid_until IS NULL OR valid_until >= '2026-04-17'))