app/policies/user_policy.rb

    def admin?
      UserRoleSchool.where(user: user, school: Current.school).active_on.where(role: %w[super_admin admin]).exists?
---
SELECT 1 AS one FROM "user_role_schools" WHERE "user_role_schools"."user_id" = 1 AND "user_role_schools"."school_id" = 1 AND (valid_from <= '2026-04-17' AND (valid_until IS NULL OR valid_until >= '2026-04-17')) AND "user_role_schools"."role" IN (0, 1) LIMIT 1