app/controllers/students/transcripts_controller.rb

  def index
    if current_user_has_role?(:student)
      @transcripts = policy_scope(Transcript)
                       .joins(:enrollment)
                       .where(enrollments: { user: current_user, school: current_school })
                       .order(academic_year: :desc)
    else
      student = User.find_by(id: params[:user_id])
      if student
        @transcripts = Transcript.joins(:enrollment)
                                  .where(enrollments: { user: student, school: current_school })
                                  .order(academic_year: :desc)
---
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."school_id" = 1 AND "enrollments"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "transcripts".* FROM "transcripts" INNER JOIN "enrollments" ON "enrollments"."school_id" = 1 AND "enrollments"."id" = "transcripts"."enrollment_id" WHERE "enrollments"."user_id" = 4 AND "enrollments"."user_id" = 4 AND "enrollments"."school_id" = 1 ORDER BY "transcripts"."academic_year" DESC

  def show
    @transcript = Transcript.joins(:enrollment)
                             .where(enrollments: { school: current_school })
                             .find(params[:id])
    authorize @transcript
    @enrollment = @transcript.enrollment
    @student    = @enrollment.user
    @subjects   = @enrollment.subjects_for_transcript.order(:name)
    @grading_instances = GradingInstance.joins(:study_plan)
                                         .where(study_plans: { school: current_school })
                                         .where(study_plan: @enrollment.course&.study_plan,
                                                academic_year: @transcript.academic_year)
                                         .order(:position)
---
SELECT "transcripts".* FROM "transcripts" INNER JOIN "enrollments" ON "enrollments"."school_id" = 1 AND "enrollments"."id" = "transcripts"."enrollment_id" WHERE "enrollments"."school_id" = 1 AND "transcripts"."id" = 1 LIMIT 1
SELECT "grading_instances".* FROM "grading_instances" INNER JOIN "study_plans" ON "study_plans"."school_id" = 1 AND "study_plans"."id" = "grading_instances"."study_plan_id" WHERE "study_plans"."school_id" = 1 AND "grading_instances"."study_plan_id" = 1 AND "grading_instances"."academic_year" = 2026 ORDER BY "grading_instances"."position" ASC