app/controllers/application_controller.rb

SELECT "user_role_schools"."role" FROM "user_role_schools" WHERE "user_role_schools"."user_id" = 1 AND "user_role_schools"."school_id" = 1 AND (valid_from <= '2026-04-17' AND (valid_until IS NULL OR valid_until >= '2026-04-17'))
---
  def current_user_roles
    return [] unless current_user && current_school
    @current_user_roles ||= UserRoleSchool.where(user: current_user, school: current_school)
                                          .active_on
                                          .pluck(:role)