app/models/user.rb

  def has_role_at?(role, school)
    user_role_schools.active_on.exists?(school: school, role: UserRoleSchool.roles[role])
---
SELECT 1 AS one FROM "user_role_schools" WHERE "user_role_schools"."user_id" = 3 AND (valid_from <= '2026-04-17' AND (valid_until IS NULL OR valid_until >= '2026-04-17')) AND "user_role_schools"."school_id" = 1 AND "user_role_schools"."role" = 4 LIMIT 1