app/views/admin/users/index.html.erb

          <td class="px-4 py-3">
            <% user.user_role_schools.select { |urs| urs.school_id == current_school.id }.each do |urs| %>
---
SELECT "user_role_schools".* FROM "user_role_schools" WHERE "user_role_schools"."user_id" = 1